# 1. Установка пакета pillow в глобальное окружение и в виртуальное окружение.
# Формат вывода результата:
# Файлы скриншотов прислать одним архивом. Для git это условие необязательно.
#
# Техническое задание
#
# Каждый пункт ТЗ вы подтверждаете скриншотом. Файлы скриншотов нумеровать двухразрядными числами, например: «01.jpg», «02.jpg».
# Если будут проблемы с pillow - можно поработать с другим пакетом: например, requests.
# Проверить, установлен ли пакет pillow в глобальном окружении. Если да — зафиксировать версию (скриншот).
# Установить самую свежую версию pillow, если ранее она не была установлена (скриншот).
# Создать и активировать виртуальное окружение. Убедиться, что в нем нет пакета pillow (скриншот).
# Установить в виртуальное окружение pillow версии 7.1.1 (или другой, отличной от самой свежей) (скриншот).
# Деактивировать виртуальное окружение (скриншот).
# Итого пять скриншотов.

